[
    {
        "ques": "Bitmap là dạng hình ảnh graphic có độ phân giải cao nhất và có thể phóng to tuỳ ",
        "ans": "Sai"
    },
    {
        "ques": "Bạn không thể cầm, kéo, thả thanh công cụ ra khỏi vị trí mặc định bên trái màn hình. Đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Bảng Layer trên Illustrator có cách quản lý layer tương tự như Illustrator, đúng",
        "ans": "Đúng"
    },
    {
        "ques": "Bảng Pathfinder có thể làm việc được với thành phần nào sau đây?",
        "ans": "path"
    },
    {
        "ques": "Bảng nào có thể đặt lại font, kích thước font sau đây?",
        "ans": "Character"
    },
    {
        "ques": "Bảng nào hiển thị toàn bộ thông tin về tệp tin hiện đang mở và các đối tượng đan",
        "ans": "Infor"
    },
    {
        "ques": "Chế độ hoà trộn trong InDesign không áp dụng được khi cả 2 đối tượng chồng nhau ",
        "ans": "Sai"
    },
    {
        "ques": "Chế độ xem nào cho phép xem toàn bộ tệp tin dạng toàn màn hình với background màu đen?",
        "ans": "Presentation mode"
    },
    {
        "ques": "Các thành phần được thiết kế trên trang master được gọi là?",
        "ans": "Master item"
    },
    {
        "ques": "Các tuỳ chọn trên bảng Pathfinder của InDesign hoàn toàn giống với Illustrator, ",
        "ans": "Đúng"
    },
    {
        "ques": "Cách sắp xếp cửa sổ và các bảng trong chương trình InDesign được gọi là gì?",
        "ans": "Không gian làm việc"
    },
    {
        "ques": "Có 2 kiểu  gradient trong InDesign, đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Có bao nhiêu kiểu hiển thị khi Place hình ảnh dạng vector vào InDesign?",
        "ans": "3"
    },
    {
        "ques": "Có thẻ lựa chọn lệnh Table of Content thông qua menu nào sau đây?",
        "ans": "Layout"
    },
    {
        "ques": "Có thể biến đổi hiệu ứng cho các góc của hình khối thông qua lệnh nào sau đây?",
        "ans": "Live Corner Effects"
    },
    {
        "ques": "Có thể chỉnh sửa màu gradient thông qua bảng nào sau đây?",
        "ans": "Gradient"
    },
    {
        "ques": "Có thể căn chỉnh các đối tượng trên vùng làm việc thông qua bảng nào sau đây?",
        "ans": "Align"
    },
    {
        "ques": "Có thể cầm kéo thả mẫu màu có trong bảng Swatches để tô màu cho đối tượng, đúng ",
        "ans": "Đúng"
    },
    {
        "ques": "Có thể ghi đè các master item trên những trang trong tệp, đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Có thể loạ bỏ màu cho đường viền thông qua bảng nào sau đây?",
        "ans": "Swatches"
    },
    {
        "ques": "Có thể loại bỏ màu đường viền (stroke) của đối tượng thông qua bảng nào sau đây?",
        "ans": "Swatches"
    },
    {
        "ques": "Có thể lưu dạng uốn cong văn bản thành dạng style được, đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Có thể thay đổi giữa các chế độ hiển thị Normal mode và Preview Screen mode thông qua phím W. Đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Có thể tìm thấy lệnh Bulleted & Numbered Lists thông qua menu nào sau đây?",
        "ans": "Type"
    },
    {
        "ques": "Có thể tạo ra màu tint thông qua lệnh nào của bảng Swatches?",
        "ans": "New Color Swatch"
    },
    {
        "ques": "Có thể tạo được màu Spot thông qua tuỳ chọn nào của lệnh New Color Swatch?",
        "ans": "Color Type"
    },
    {
        "ques": "Có thể uốn cong đoạn văn bản xung quanh hình ảnh thông qua bảng nào sau đây?",
        "ans": "Text Wrap"
    },
    {
        "ques": "Có thể áp dụng trang master cho trang con trong tệp thông qua lệnh nào sau đây?",
        "ans": "Apply Master to Pages"
    },
    {
        "ques": "Có thể điều chỉnh độ dày của đường viền thông qua bảng nào sau đây?",
        "ans": "Stroke"
    },
    {
        "ques": "Có thể đánh số trang thông qua lệnh nào trên bảng Page?",
        "ans": "Numbering and Section Options"
    },
    {
        "ques": "Có thể định kiểu (style) cho một ký tự thông qua bảng nào sau đây?",
        "ans": "Character Style"
    },
    {
        "ques": "Công cụ Gradient Feather có thể tác động lên đường viền vật thể, làm mềm đường viền. Đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Công cụ Gradient có thể thay đổi được hướng gradient, đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Công cụ nào giúp tạo độ mịn khi chuyển màu trong màu gradient?",
        "ans": "Gradient Feather"
    },
    {
        "ques": "Công cụ nào sau đây có thể điều chỉnh được diện tích gradient?",
        "ans": "Gradient"
    },
    {
        "ques": "Công cụ nào sau đây có thể điều chỉnh được khoảng cách trống giữa các đối tượng?",
        "ans": "Gap"
    },
    {
        "ques": "Công cụ nào sau đây giúp thực hiện thao tác nhập chữ trên đường path?",
        "ans": "Type on path"
    },
    {
        "ques": "Công cụ nào sau đây giúp điều chỉnh lại hướng của thanh điều hướng?",
        "ans": "Convert anchor point"
    },
    {
        "ques": "Hiệu ứng cũng có thể được lưu lại dưới định dạng kiểu (style) của đối tượng, đún",
        "ans": "Đúng"
    },
    {
        "ques": "InDesign chỉ cho phép làm việc với một file có các trang cùng kích thước, đúng h",
        "ans": "Sai"
    },
    {
        "ques": "InDesign chỉ làm việc được với hình ảnh dạng bitmap, đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "InDesign coi Table giống như dạng text, đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "InDesign có cho phép làm việc với file có định dạng .psd không?",
        "ans": "Có"
    },
    {
        "ques": "InDesign có thể tạo file có kích thước phù hợp với thiết bị nào sau đây?",
        "ans": "iPad"
    },
    {
        "ques": "InDesign không cho phép Place nhiều hình ảnh, đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "InDesign không cho phép nhập ký tự có dấu mũ, đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "InDesign không làm việc được với hệ màu RGB, đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Khi chỉnh sửa màu gradient, tất cả các kế thừa của màu gradient đó sẽ?",
        "ans": "Tự động cập nhật"
    },
    {
        "ques": "Khi căn chỉnh với Tab, có thể lựa chọn các điểm đánh dấu đầu dòng dạng bullet, đ",
        "ans": "Đúng"
    },
    {
        "ques": "Khi khởi tạo file mới, có thể lựa chọn số trang ngay trong hộp thoại New Documen",
        "ans": "Number of Pages"
    },
    {
        "ques": "Khi lựa chọn màu trên bảng Color, sau khi áp dụng màu đó cho đối tượng thì tự độ",
        "ans": "Không được lưu tại bất kỳ bảng nào"
    },
    {
        "ques": "Khi sử dụng công cụ Pen để vẽ sẽ tạo ra thành phần đồ hoạ nào?",
        "ans": "Đường path"
    },
    {
        "ques": "Khi sử dụng lệnh Step and Repeat, có thể sao chép và dán thành bao nhiêu đối tượ",
        "ans": "Không giới hạn, miễn là đối tượng sau khi sao chép nằm vừa vùng pasteboard"
    },
    {
        "ques": "Khi sử dụng lệnh Step and Repeat, không thể áp dụng cho graphic frame, đúng hay ",
        "ans": "Sai"
    },
    {
        "ques": "Khi sử dụng tổ hợp phím tắt Ctrl + ; sẽ giúp thực hiện điều gì sau đây?",
        "ans": "Hiển thị/ ẩn đường Guide"
    },
    {
        "ques": "Khi thực hiện Place hình ảnh vào InDesign thì có hiện tượng nào sẽ xảy ra sau đâ",
        "ans": "Nếu hình ảnh to hơn khung frame thì InDesign sẽ tự động crop hình ảnh đó"
    },
    {
        "ques": "Khi thực hiện gen file thành dạng trang Index cần chú ý điều gì?",
        "ans": "Luôn lựa chọn tuỳ chọn Include Book Document"
    },
    {
        "ques": "Khi thực hiện kéo icon fx sang đối tượng khác đồng nghĩa với việc thực hiện điều",
        "ans": "copy hiệu ứng và áp dụng cho đối tượng khác"
    },
    {
        "ques": "Khi áp dụng hiệu ứng trong InDesign, không thể thay đổi được thông số giá trị mặ",
        "ans": "Sai"
    },
    {
        "ques": "Khi đã có kiểu (style), không thể áp dụng cho ký tự khác được, đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Khi đã thực hiện chuyển đổi text thành dạng vector thì không thể chuyển đổi ngượ",
        "ans": "Đúng"
    },
    {
        "ques": "Khu vực xung quanh tài liệu làm việc, mở rộng các đối tượng làm việc được gọi là?",
        "ans": "Pasteboard"
    },
    {
        "ques": "Không thể biến đổi đường viền của một hình khối thành dạng đường nét đứt, đúng h",
        "ans": "Sai"
    },
    {
        "ques": "Không thể bẻ cong được đường path, đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Không thể tách (detach) một đối tượng master item, đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Không thể đặt thông số cho độ phân giải của file khi khởi tạo, đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Muốn thụt lùi đầu dòng của dòng đầu tiên trong khối nội dung văn bản, trong InDe",
        "ans": "Tab"
    },
    {
        "ques": "Muốn truy cập vào hộp thoại Polygon Setting, cần thực hiện như thế nào?",
        "ans": "Lựa chọn nhấn đúp chuột vào công cụ Polygon"
    },
    {
        "ques": "Mẫu màu trong bảng Swatches là mặc định, không thể thêm/ sửa/ xoá bất kì",
        "ans": "Sai"
    },
    {
        "ques": "Ngoài cách copy/ paste khối nội dung văn bản từ bên ngoài vào InDesign, ta c",
        "ans": "Sử dụng cách Place file văn bản vào InDesign"
    },
    {
        "ques": "Nút nào có xuất hiện trên thanh công cụ?",
        "ans": "Apply Gradient"
    },
    {
        "ques": "Nếu hình ảnh được Place vào một ô của Table mà hình ảnh đó quá to thì điều gì sẽ",
        "ans": "Kích thươc của hình ảnh sẽ tự động thu nhỏ để phù hợp với kích cỡ của ô"
    },
    {
        "ques": "Nếu không muốn trang trong tệp áp dụng trang master, có thể thực hiện bằng cách ",
        "ans": "Áp dụng trang None master cho trang trong tệp"
    },
    {
        "ques": "Nếu như trang quá to, muốn kéo tới phần đối tượng khác để làm việc, ta có thể sử dụng công cụ nào sau đây?",
        "ans": "Hand"
    },
    {
        "ques": "Table có thể được tạo trong thành phần nào sau đây?",
        "ans": "textframe"
    },
    {
        "ques": "Theo mặc định khi Place hình ảnh vào InDesign thì đồng nghĩa với việc gì/",
        "ans": "InDesign sẽ ghi nhớ đường dẫn tới file bạn vừa Place vào"
    },
    {
        "ques": "Theo mặc định, chỉ có 1 hiệu ứng cho các góc của hình khối, đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Theo mặc định, không thể căn trái các đối tượng đang có trên vùng làm việc, đúng",
        "ans": "Sai"
    },
    {
        "ques": "Theo mặc định, trang master đầu tiên sẽ được đặt tên theo dạng?",
        "ans": "A- Master"
    },
    {
        "ques": "Thành phần nào cho phép tạo ra hiệu ứng về trộn màu sắc cũng như sự khác biệt củ",
        "ans": "chế độ hoà trộn"
    },
    {
        "ques": "Thành phần nào chỉ xuất hiện trong bảng Color mà không có trên bảng Swatches?",
        "ans": "Thanh trượt màu"
    },
    {
        "ques": "Thành phần nào có thể chỉnh sửa thông qua bảng Character/",
        "ans": "Kerning"
    },
    {
        "ques": "Thành phần nào giúp căn chỉnh các đối tượng một cách thẳng hàng, khi di chuyển đối tượng tới gần thành phần này thì các đối tượng sẽ tự động bắt dính?",
        "ans": "Guide"
    },
    {
        "ques": "Thành phần nào sau đây không xuất hiện trên hộp thoại New Document?",
        "ans": "Leading"
    },
    {
        "ques": "Thành phần nào sau đây được định nghĩa như dạng template (mẫu) được thiết kế để ",
        "ans": "Master"
    },
    {
        "ques": "Thành phần nào thường được sử dụng để tạo trang mục lục?",
        "ans": "paragraph style"
    },
    {
        "ques": "Thành phần nào xuất hiện trên bảng Text Wrap?",
        "ans": "Wrap To"
    },
    {
        "ques": "Thành phần nào được định nghĩa là đường gióng của đoạn văn bản?",
        "ans": "baseline"
    },
    {
        "ques": "Thành phần nào được định nghĩa như một nhóm các thuộc tính của đối tượng?",
        "ans": "Kiểu (style)"
    },
    {
        "ques": "Thành phần đồ hoạ nào được xây dựng dựa trên các điểm neo và các đường path?",
        "ans": "Vector"
    },
    {
        "ques": "Trang master chỉ có thể áp dụng cho 1 trang con trong toàn bộ tệp tin, đúng hay ",
        "ans": "Sai"
    },
    {
        "ques": "Trong bảng (panel) Table có thể căn chỉnh được yếu tố nào sau đây?",
        "ans": "Căn chỉnh khối nội dung theo dạng giữa ô"
    },
    {
        "ques": "Trong bảng (panel) Table có thể lựa chọn nhập text theo chiều nào?",
        "ans": "Chiều ngang"
    },
    {
        "ques": "Trong cuốn sách hoàn chỉnh, thành phần nào sau đây không thể thiếu được?",
        "ans": "Số trang"
    },
    {
        "ques": "Trong hộp thoại New Document có thể lựa chọn mấy tuỳ chọn về kiểu hiển thị khôn ",
        "ans": "2"
    },
    {
        "ques": "Trong hộp thoại Polygon Setting không thể lựa chọn được số cạnh của đa giác cần ",
        "ans": "Sai"
    },
    {
        "ques": "Trên bảng Layer, khi xuất hiện icon dạng ngòi bút (Pen) bên cạnh layer có nghĩa ",
        "ans": "layer đó đang được chọn và đang có các đối tượng được vẽ trên layer này"
    },
    {
        "ques": "Trên bảng Link sẽ hiển thị điều gì bên cạnh hình ảnh vừa Place vào?",
        "ans": "Thứ tự trang mà hình ảnh được place vào"
    },
    {
        "ques": "Trên bảng Text Wrap, tuỳ chọn Wrap To quy định điều gì?",
        "ans": "Quy định cách mà nội dung văn bản sẽ uốn cong quanh hình ảnh/ hình khối"
    },
    {
        "ques": "Tuỳ chọn Align Stroke trên bảng Stroke quy định điều gì?",
        "ans": "Quy định nơi đường viền được áp dụng"
    },
    {
        "ques": "Tuỳ chọn nào có xuất hiện trên bảng Align?",
        "ans": "Use Spacing"
    },
    {
        "ques": "Tuỳ chọn nào trên bảng Pathfinder sẽ ưu tiên sử dụng khối bên trên để cắt khối h",
        "ans": "subtract"
    },
    {
        "ques": "Tuỳ chọn nào xuất hiện trên bảng Table?",
        "ans": "Row Height"
    },
    {
        "ques": "Tuỳ chọn nào xuất hiện trên hộp thoại tuỳ chọn Insert Table?",
        "ans": "Footer Rows"
    },
    {
        "ques": "Uốn cong đoạn văn bản quanh hình ảnh (hình khối) cũng là một thuộc tính của text",
        "ans": "Sai"
    },
    {
        "ques": "Với công cụ Zoom, khi thực hiện nhấn đúp chuột vào công cụ nàu trên thanh công cụ thì hiện tượng gì sẽ xảy ra?",
        "ans": "Đối tượng đang được phóng to trên cửa sổ làm việc sẽ trở về dạng xem 100%"
    },
    {
        "ques": "nếu như đang bật phím Caps Lock, khi nhấn phím P thì InDesign sẽ không chuyển sang công cụ Pen. Đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Đâu là giải thích đúng về màu tint?",
        "ans": "Là một màu đặc biệt có độ sáng được giảm bớt"
    },
    {
        "ques": "Đâu là một dạng hiển thị hình ảnh dạng vector vào InDesign?",
        "ans": "Typical"
    },
    {
        "ques": "Đâu là một trong những giá trị của textframe?",
        "ans": "In port"
    },
    {
        "ques": "Đâu là một trong những không gian làm việc trên InDesign?",
        "ans": "Typography"
    },
    {
        "ques": "Đâu là một trong những kiểu của đường viền?",
        "ans": "stripe"
    },
    {
        "ques": "Đâu là một trong số những hiệu ứng mà InDesign cung cấp?",
        "ans": "Gradient feather"
    },
    {
        "ques": "Đâu là một trong số tuỳ chọn của lệnh Fitting?",
        "ans": "Fit Frame to Content"
    },
    {
        "ques": "Đâu là đơn vị tính của độ phân giải?",
        "ans": "PPI"
    },
    {
        "ques": "Đâu là định dạng file mà InDesign có thể làm việc được?",
        "ans": ".ai"
    },
    {
        "ques": "Đâu là định nghĩa chính xác về màu spot?",
        "ans": "Là màu không phải là màu quy trình và do một công ty thứ 3 sản xuất"
    },
    {
        "ques": "Đâu là định nghĩa về Clipping path?",
        "ans": "Là vùng bao ngoài của đối tượng, có thể được tạo bởi các chương trình đồ hoạ khác hoặc Ngay trong InDesign"
    },
    {
        "ques": "Đơn vị tính trên thanh ruler của Tab là inch, không thể thay đổi thành dạng đơn ",
        "ans": "Sai"
    },
    {
        "ques": "Để hiển thị thêm một bảng trong chương trình, có thể sử dụng thông qua menu nào sau đây?",
        "ans": "Window"
    },
    {
        "ques": "Để sao chép và dán đối tượng vào một khu vực với khoảng cách chính xác, có thể s",
        "ans": "Step and repeat"
    },
    {
        "ques": "Để thay đổi kiểu dáng áp dụng cho các góc khi thực hiện lệnh Live Corner Effects",
        "ans": "Đúng"
    },
    {
        "ques": "Để thực hiện chuyển đổi text thành dạng vector phải lựa chọn lệnh nào sau đây?",
        "ans": "Conver Outline"
    },
    {
        "ques": "Để thực hiện uốn cong đoạn văn bản quanh hình ảnh, trước tiên phải lựa chọn cả 2",
        "ans": "Đúng"
    },
    {
        "ques": "Để tắt chế độ uốn văn bản quanh hình ảnh, có thể sử dụng lệnh nào trong menu Obj",
        "ans": "Ignore Text Wrap"
    },
    {
        "ques": "Đối tượng hình khối trên trang có những thuộc tính gì?",
        "ans": "Màu tô và màu đường viền"
    },
    {
        "ques": "Đối với màu Spot được tạo bởi các chương trình đồ hoạ khác, sau khi được import ",
        "ans": "Tự động được lưu trong bảng Swatches"
    }
]