[
    {
        "ques": "Blend được tạo ra với những phương pháp nào sau đây?",
        "ans": "sử dụng công cụ Blending hoặc lệnh Make Blend"
    },
    {
        "ques": "Bạn có thể ẩn toàn bộ các bảng đang được mở, kể cả thanh công cụ, bằng cách nhấn",
        "ans": "Tab"
    },
    {
        "ques": "Bạn có thể ẩn toàn bộ các bảng đang được mở, kể cả thanh công cụ, bằng cách nhấn phím tắt nào sau đây?",
        "ans": "Tab"
    },
    {
        "ques": "Bảng Color cũng sử dụng kết hợp được với bảng Gradient, đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Bảng nào quản lý thư viện brush?",
        "ans": "Brushes"
    },
    {
        "ques": "Bảng nào quản lý được pattern (chất liệu)?",
        "ans": "Pattern Option"
    },
    {
        "ques": "Bảng nào sau đây giúp cắt trích hình ảnh chồng chéo?",
        "ans": "pathfinder"
    },
    {
        "ques": "Chỉ có thể vẽ trên một mặt của môi trường phối cảnh. Đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Crop mark được hiển thị trên bảng nào, để điều chỉnh?",
        "ans": "appearance"
    },
    {
        "ques": "Cyan là màu cơ bản trong hệ màu nào sau đây?",
        "ans": "hệ màu subtractive"
    },
    {
        "ques": "Các màu Red, Green, Blue khi kết hợp với nhau sẽ tạo ra ánh sáng gì?",
        "ans": "ánh sáng trắng"
    },
    {
        "ques": "Có  bao nhiêu thư viện brush chính?",
        "ans": "5"
    },
    {
        "ques": "Có bao nhiêu kiểu gradient?",
        "ans": "2"
    },
    {
        "ques": "Có bao nhiêu kiểu tô màu gradient?",
        "ans": "2"
    },
    {
        "ques": "Có bao nhiêu phương pháp thực hiện thiết kế theo dạng phối cảnh?",
        "ans": "3"
    },
    {
        "ques": "Có bao nhiêu thư viện brush chính?",
        "ans": "5"
    },
    {
        "ques": "Có bao nhiêu tuỳ chọn để thực hiện Envelopes?",
        "ans": "3"
    },
    {
        "ques": "Có mấy cách sao chép đối tượng trên Illustrator",
        "ans": "4"
    },
    {
        "ques": "Có thể chuyển đổi hình ảnh dạng bitmap thành dạng brush được không?",
        "ans": "Có"
    },
    {
        "ques": "Có thể hiển thị các bảng trong Illustrator thông qua menu nào sau đây?",
        "ans": "Window"
    },
    {
        "ques": "Có thể sử dụng lệnh Make Slice để tạo lắt cắt phù hợp với khung hình. ĐÚng hay s",
        "ans": "Đúng"
    },
    {
        "ques": "Có thể sử dụng lệnh Make Slice để tạo lắt cắt phù hợp với khung hình. ĐÚng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Có thể thay đổi kích thước của brush thông qua phím tắt nào?",
        "ans": "phím [, ]"
    },
    {
        "ques": "Có thể thay đổi kích thước file vector graphic mà không ảnh hưởng tới điều gì sa",
        "ans": "chất lượng file"
    },
    {
        "ques": "Có thể thay đổi kích thước file vector graphic mà không ảnh hưởng tới điều gì sau đây?",
        "ans": "chất lượng file"
    },
    {
        "ques": "Có thể vẽ hình thông qua công cụ nào sau đây?",
        "ans": "Pen"
    },
    {
        "ques": "Có thể xoay đối tượng bằng tay thông qua phần tuỳ chọn nào trên hộp thoại 3D Ext",
        "ans": "Rotation Cube"
    },
    {
        "ques": "Có thể xoay đối tượng bằng tay thông qua phần tuỳ chọn nào trên hộp thoại 3D Extrude &amp; Bevel?",
        "ans": "Rotation Cube"
    },
    {
        "ques": "Có thể định nghĩa stroke (đường viền) dạng đường nét đứt thông qua bảng nào sau ",
        "ans": "Stroke"
    },
    {
        "ques": "Có thể định nghĩa stroke (đường viền) dạng đường nét đứt thông qua bảng nào sau đây?",
        "ans": "Stroke"
    },
    {
        "ques": "Công cụ Direct Selection giúp chọn và di chuyển - thay đổi vị trí - hình dáng đường path. Đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Công cụ Direct Selection giúp cầm và di chuyển đường path. Đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Công cụ Live Paint Bucket sử dụng hai kiểu đối tượng. ĐÚng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Công cụ nào cho phép chỉnh sửa đường path của stroke?",
        "ans": "width"
    },
    {
        "ques": "Công cụ nào cho phép nhập văn bản bên trong một đối tượng",
        "ans": "Area type"
    },
    {
        "ques": "Công cụ nào có thể di chuyển đối tượng trong môi trường phối cảnh Perspective Grid?",
        "ans": "perspective selection"
    },
    {
        "ques": "Công cụ nào có thể nhanh chóng áp dụng thuộc tính của một đối tượng cho đối tượn",
        "ans": "Eyedropper"
    },
    {
        "ques": "Công cụ nào có thể nhanh chóng áp dụng thuộc tính của một đối tượng cho đối tượng khác?",
        "ans": "Eyedropper"
    },
    {
        "ques": "Công cụ nào giúp nhập chữ theo đường path?",
        "ans": "Type on a path"
    },
    {
        "ques": "Công cụ nào giúp tạo nhiều symbol instance một cách nhanh chóng?",
        "ans": "Symbol Sprayer"
    },
    {
        "ques": "Công cụ nào sau đây có thể tác động tới graph?",
        "ans": "group selection"
    },
    {
        "ques": "Công cụ nào sau đây giúp ta thực hiện vẽ theo dạng phối cảnh?",
        "ans": "perspective grid"
    },
    {
        "ques": "Công cụ nào trong Illustrator cho phép cắt hình ảnh thành nhiều mảnh nhỏ, để phục vụ cho web?",
        "ans": "slice"
    },
    {
        "ques": "Công cụ nào trong nhóm công cụ Pen có tác dụng điều chỉnh thanh điều hướng?",
        "ans": "Convert Anchor Point"
    },
    {
        "ques": "Công cụ nào được sử dụng để tạo ra hiệu quả như nét vẽ phác thảo?",
        "ans": "paintbrush"
    },
    {
        "ques": "DPI viết tắt bởi?",
        "ans": "dots per inch"
    },
    {
        "ques": "Dữ liệu sử dụng để vẽ graph được lưu trữ tại đâu?",
        "ans": "trong cửa sổ Graph Data"
    },
    {
        "ques": "Envelopes được sử dụng để biến đổi layer khởi tạo. Đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "File định dạng pdf có thể hiển thị được crop mark. Đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Giá trị nào có thể được áp dụng cho từng điểm mesh?",
        "ans": "Opacity"
    },
    {
        "ques": "Giá trị nào xác định mức độ thay đổi của đối tượng 2D khi chuyển thành đối tượng",
        "ans": "Extrude Depth"
    },
    {
        "ques": "Giá trị nào xác định mức độ thay đổi của đối tượng 2D khi chuyển thành đối tượng 3D?",
        "ans": "Extrude Depth"
    },
    {
        "ques": "Graph là dạng đối tượng gì sau đây?",
        "ans": "đối tượng nhóm"
    },
    {
        "ques": "Hình ảnh Illustrator sau khi Rasterize có thể được gọi là hình ảnh dạng bimap. đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Hệ màu CMYK lớn hơn nhiều so với hệ màu RGB. Đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Hệ màu CMYK thường được sử dụng trong in ấn công nghiệp, đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Illustrator hỗ trợ vẽ minh hoạ theo dạng số liệu, ví dụ như dạng biểu đồ. Đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Illustrator không cho phép xuất file dưới định dạng pdf. Đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Illustrator không thể tạo ra đối tượng 3D, đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Khi dữ liệu được tạo bởi Excel, muốn nhập vào Illustrator thì bắt buộc phải được lưu dưới dạng gì?",
        "ans": "text file"
    },
    {
        "ques": "Khi khởi tạo đối tượng Mesh, điều gì sẽ xảy ra?",
        "ans": "thêm nhiều ô lưới sẽ xuất hiện"
    },
    {
        "ques": "Khi kéo symbol ra khỏi bảng Symbol để sử dụng Cần thiết phải thực hiện thao tác nào sau đây?",
        "ans": "break link"
    },
    {
        "ques": "Khi làm việc với Envelopes, đối tượng nào cần thiết phải được khởi tạo?",
        "ans": "hình khối để tạo khung biến dạng"
    },
    {
        "ques": "Khi lựa chọn hiển thị bảng thông qua menu Window, bảng sẽ được hiển thị theo dạng đầy đủ, mở rộng. Đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Khi số lượng các đối tượng blend nhiều thì sẽ giúp hiệu quả gì sau đây?",
        "ans": "sẽ tạo ra hiệu ứng \"smooth\" (mượt) hơn khi đối tượng blend được hoàn thiện"
    },
    {
        "ques": "Khi sử dụng brush Scatter, muốn tạo khoảng cố định hay ngẫu nhiên của đối tượng, phải sử dụng trên hộp thoại nào?",
        "ans": "Brush Option"
    },
    {
        "ques": "Khi sử dụng các công cụ : Rotate ; Scale ; Shear , cần kết hợp phím nào để hiển thị các tuỳ chọn",
        "ans": "Alt"
    },
    {
        "ques": "Khi sử dụng công cụ Zoom, muốn thu nhỏ tầm nhìn của vùng hình ảnh, phải sử dụng cùng phím tắt nào sau đây?",
        "ans": "Alt"
    },
    {
        "ques": "Khi sử dụng công cụ Zoom, sau khi phóng to tầm hình của hình ảnh, muốn di chuyển tới vùng hình ảnh cần làm việc, phải sử dụng cùng phím nào sau đây?",
        "ans": "Spacebar (dấu cách)"
    },
    {
        "ques": "Khi sử dụng graph, dữ liệu có thể được nhập từ các chương trình khác. Đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Khi sử dụng lệnh Image Trace có thể kết hợp với bảng nào để tạo thêm hiệu quả cho hình ảnh được trace?",
        "ans": "Image Trace"
    },
    {
        "ques": "Khi thiết kế dạng graph tuỳ chỉnh, chỉ đối tượng nào mới có thể sử dụng được?",
        "ans": "đối tượng vector"
    },
    {
        "ques": "Khi thực hiện vẽ trong chế độ Perspective Grid, các công cụ tạo hình cơ bản sẽ v",
        "ans": "vẽ trong môi trường phối cảnh"
    },
    {
        "ques": "Khi áp dụng Extrude & Bevel thì yếu tố nào sau đây được tự động áp dụng?",
        "ans": "lighting và shading"
    },
    {
        "ques": "Khi áp dụng Extrude &amp; Bevel thì yếu tố nào sau đây được tự động áp dụng?",
        "ans": "lighting và shading"
    },
    {
        "ques": "Khi đã chuyển đổi đối tượng thành đối tượng mesh ta có thể xoá các điểm neo để đối tượng trở về hình",
        "ans": "Đúng"
    },
    {
        "ques": "Khi đã chuyển đổi đối tượng thành đối tượng mesh ta có thể xoá các điểm neo để đối tượng trở về hình thái ban đầu, đúng hay sai ?",
        "ans": "Đúng"
    },
    {
        "ques": "Khi định nghĩa stroke dạng đường nét đứt thì không thể định nghĩa độ dài của các",
        "ans": "Sai"
    },
    {
        "ques": "Khi định nghĩa stroke dạng đường nét đứt thì không thể định nghĩa độ dài của các đoạn nét đứt. Đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Không thể sử dụng công cụ selection để lựa chọn Crop mark, đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Không thể thay đổi được cách phối cảnh theo các điểm tụ khác nhau với công cụ Perspective Grid. Đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Không thể thay đổi được hình ảnh minh hoạ của các bề mặt khối 3D. Đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Không thể thay đổi được tuỳ chọn Blend, đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Làm cách nào để hiển thị các công cụ bị ẩn trong Illustrator?",
        "ans": "Nhấn và giữ phím trái chuột, sau đó lựa chọn"
    },
    {
        "ques": "Làm cách nào để hiển thị các công cụ còn ẩn bên trong của một công cụ nhóm trên Illustrator?",
        "ans": "Nhấn và giữ phím trái chuột, sau đó lựa chọn"
    },
    {
        "ques": "Lệnh Create Gradient Mesh giúp khởi tạo thành phần nào sau đây của lưới?",
        "ans": "hàng và cột"
    },
    {
        "ques": "Lệnh Move có thể tạo ra pattern dạng đơn giản. Đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Lệnh nào sau đây giúp chuyển đổi hình ảnh từ dạng bitmap thành dạng vector?",
        "ans": "Image Trace"
    },
    {
        "ques": "Lệnh nào sau đây sẽ hợp nhất 2 điểm neo?",
        "ans": "Join"
    },
    {
        "ques": "Menu Bevel cung cấp bao nhiêu hình dạng sẵn?",
        "ans": "10"
    },
    {
        "ques": "Menu Bevel trong hộp thoại 3D Extrude & Bevel có thể được sử dụng để áp dụng",
        "ans": "áp dụng cho các cạnh đối tượng"
    },
    {
        "ques": "Menu Bevel trong hộp thoại 3D Extrude &amp; Bevel có thể được sử dụng để áp dụng cho điều gì?",
        "ans": "áp dụng cho các cạnh đối tượng"
    },
    {
        "ques": "Màu gradient được tạo ra từ phương pháp nào?",
        "ans": "Từ phương pháp trộn các màu sắc khác lại với nhau"
    },
    {
        "ques": "Nhóm công cụ con có thể được tách ra thành một bảng riêng, đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Pattern chỉ được áp dụng cho một đối tượng duy nhất. Đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Pattern có thể được lưu trong bảng nào sau đây?",
        "ans": "Swatches"
    },
    {
        "ques": "Phát biểu  Mỗi một công cụ sẽ có thanh Control riêng  điều này đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Phát biểu \"Mỗi một công cụ sẽ có thanh Control riêng\" điều này đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Quang phổ khả kiến chia làm mấy loại màu sắc?",
        "ans": "7"
    },
    {
        "ques": "Radar không phải là một kiểu graph trong Illustrator. Đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Sau khi sử dụng lệnh Image Trace, cần thực hiện lựa chọn thêm tuỳ chọn nào để hình ảnh xuất hiện điểm neo và đường path?",
        "ans": "Expand"
    },
    {
        "ques": "Shading bao gồm bao nhiêu kiểu bề mặt?",
        "ans": "3"
    },
    {
        "ques": "Symbol có thể bao gồm symbol khác. Đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Symbol có thể được tạo ra từ đối tượng nào sau đây",
        "ans": "Text"
    },
    {
        "ques": "Symbol được lưu trữ trên bảng Pattern, đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Số lượng pixel trong một inch hình ảnh được gọi là?",
        "ans": "độ phân giải"
    },
    {
        "ques": "Ta có thể bo trơn  hoặc vát góc viền của một đối tượng",
        "ans": "Có"
    },
    {
        "ques": "Ta có thể bo trơn &nbsp;hoặc vát góc viền của một đối tượng",
        "ans": "Có"
    },
    {
        "ques": "Ta có thể thêm một điểm neo ( Anchor point ) trên đối tượng vẽ bằng cách :",
        "ans": "Tất cả đều sai"
    },
    {
        "ques": "Ta có thể tuỳ chọn một trong các kiểu ( type) khi sử dụng công cụ  graph. Đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Ta có thể tuỳ chọn một trong các kiểu ( type) khi sử dụng công cụ &nbsp;graph. Đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Ta có thể tách viền và nền của một đối tượng thành 2 thành phần độc lập, đúng hay sai ?",
        "ans": "Đúng"
    },
    {
        "ques": "Ta có thể tạo tài liệu có nhiều bản vẽ và đồng thời có thể sắp xếp các bản vẽ này ?",
        "ans": "Đúng"
    },
    {
        "ques": "Ta có thể đặt các đối tượng đã Blend theo một Path có sẵn ?",
        "ans": "Đúng"
    },
    {
        "ques": "Thao tác nhấn đúp chuột lên công cụ Zoom trên thanh công cụ, giúp thực hiện điều",
        "ans": "Xem file  với kích thước thật (100%)"
    },
    {
        "ques": "Thao tác nhấn đúp chuột lên công cụ Zoom trên thanh công cụ, giúp thực hiện điều gì?",
        "ans": "Xem file  với kích thước thật (100%)"
    },
    {
        "ques": "Thao tác sử dụng phím Spacebar (dấu cách) để di chuyển tới vùng cần làm việc tươ",
        "ans": "Hand"
    },
    {
        "ques": "Thao tác sử dụng phím Spacebar (dấu cách) để di chuyển tới vùng cần làm việc tương đương với việc sử dụng công cụ nào?",
        "ans": "Hand"
    },
    {
        "ques": "Thao tác thay đổi hướng điểm mesh sẽ tác động lên điều gì sau đây?",
        "ans": "thay đổi hình dạng của lưới"
    },
    {
        "ques": "Theo mặc định pattern sẽ được tô từ vùng nào?",
        "ans": "Được tô từ vùng dưới bên trái của artwork"
    },
    {
        "ques": "Theo mặc định, công cụ Perspective Grid sẽ phối cảnh theo nguyên lý 2 điểm tụ. Đ",
        "ans": "Đúng"
    },
    {
        "ques": "Theo mặc định, công cụ Perspective Grid sẽ phối cảnh theo nguyên lý 2 điểm tụ. ĐÚng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Thiết kế pattern nhằm mục đích nào sau đây?",
        "ans": "tô chất liệu cho đối tượng"
    },
    {
        "ques": "Thành phần nào  được sử dụng để thiết kế pattern?",
        "ans": "Màu sắc"
    },
    {
        "ques": "Thành phần nào được sinh ra bởi công cụ Pen?",
        "ans": "Điểm neo"
    },
    {
        "ques": "Trong Illustrator, dữ liệu có thể được biểu thị bởi bao nhiêu kiểu?",
        "ans": "3"
    },
    {
        "ques": "Trong hộp thoại 3D Extrude & Bevel Option, tuỳ chọn Caps giúp đối tượng được",
        "ans": "Đúng"
    },
    {
        "ques": "Trong hộp thoại 3D Extrude &amp; Bevel Option, tuỳ chọn Caps giúp đối tượng được hiển thị theo dạng solid hay hollow. Đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Trên Illustrator ta có thể áp dụng các tổ hợp phím dùng điều khiển các các chức năng quản lý vùng là",
        "ans": "đúng"
    },
    {
        "ques": "Trên Illustrator ta có thể áp dụng các tổ hợp phím dùng điều khiển các các chức năng quản lý vùng làm việc như di chuyển đến vùng hình ảnh, phóng to thu nhỏ ... tương tự Photoshop ?",
        "ans": "đúng"
    },
    {
        "ques": "Trên bảng Gradient, có thể thêm đươc điểm dừng màu hay không?",
        "ans": "Có"
    },
    {
        "ques": "Trên bảng Gradient, không thể thay đổi được opacity (độ mờ) của màu, đúng hay sa",
        "ans": "Sai"
    },
    {
        "ques": "Trên hộp thoại Move ta có thể nhân bản đối tượng, điều này đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Trên hộp thoại tuỳ chọn Graph Type, có thể đặt thêm điều gì cho graph?",
        "ans": "Style"
    },
    {
        "ques": "Trên đường path, không thể chèn thêm được điểm neo. Đúng hay sai?",
        "ans": "Sai"
    },
    {
        "ques": "Tuỳ chọn Covert to CMYK có thể được sử dụng thông qua menu Edit &gt; Edit Colors. Đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Tuỳ chọn Covert to CMYK có thể được sử dụng thông qua menu Edit > Edit Color",
        "ans": "Đúng"
    },
    {
        "ques": "Tuỳ chọn nào sau đây điều khiển độ mượt của shading?",
        "ans": "blend steps"
    },
    {
        "ques": "Tuỳ chọn nào được sử dụng trong quá trình thay đổi hình ảnh hiển thị trên các mặ",
        "ans": "map art"
    },
    {
        "ques": "Tuỳ chọn nào được sử dụng trong quá trình thay đổi hình ảnh hiển thị trên các mặt của đối tượng 3D?",
        "ans": "map art"
    },
    {
        "ques": "Tại bảng điều khiển Appearance ta có thể hiệu chỉnh",
        "ans": "tất cả đúng"
    },
    {
        "ques": "Tại bảng điều khiển Appearance ta có thể hiệu chỉnh các thuộc tính của đối tượng như :",
        "ans": "tất cả đúng"
    },
    {
        "ques": "Tại mỗi điểm neo sẽ có thành phần nào sau đây?",
        "ans": "Thanh điều hướng"
    },
    {
        "ques": "Tạo gradient thông qua bảng nào?",
        "ans": "Sử dụng bảng Gradient kết hợp với bảng Swatches"
    },
    {
        "ques": "Tổ hợp phím Ctrl : cho phép ẩn / hiện đường canh ( guide )",
        "ans": "Sai"
    },
    {
        "ques": "Tổ phím Ctrl D được sử dụng trong trường hợp nào ?",
        "ans": "Lặp lại một thao tác biến đổi tượng"
    },
    {
        "ques": "Tổ phím Ctrl ] &nbsp;cho phép&nbsp;",
        "ans": "Xếp đối tượng lên trên một vị trí trong thứ tự xếp chồng"
    },
    {
        "ques": "Tổ phím Ctrl ] hoặc [ cho phép :",
        "ans": "Xếp đối tượng lên trên một vị trí trong thứ tự xếp chồng"
    },
    {
        "ques": "Vector graphic có độ phân giải như thế nào?",
        "ans": "độ phân giải độc lập"
    },
    {
        "ques": "Với một đối tượng đang được chọn, chúng sẽ thể hiện trên layer dưới một kí hiệu có hình dạng :",
        "ans": "Hình vuông"
    },
    {
        "ques": "Với tuỳ chọn Make with Top Object, lệnh Envelopes sẽ ưu tiên đối tượng trên cùng",
        "ans": "Đúng"
    },
    {
        "ques": "Với tuỳ chọn Make with Top Object, lệnh Envelopes sẽ ưu tiên đối tượng trên cùng. Đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Với đường canh ( guide ) ta có thể xoay chúng từ 0 đến 360 độ đồng thời có thể sao chép ?",
        "ans": "Đúng"
    },
    {
        "ques": "Yếu tố nào giúp xác định chính xác vùng cần crop?",
        "ans": "show ruler"
    },
    {
        "ques": "có thể hiển thị hộp thoại Graph Design thông qua menu nào sau đây?",
        "ans": "Object > Graph > Design"
    },
    {
        "ques": "có thể tạo ra blend cho đường path hay không?",
        "ans": "Có"
    },
    {
        "ques": "công cụ nào tạo ra đường khép kín khi tô đối tượng?",
        "ans": "blodbrush"
    },
    {
        "ques": "công cụ paintbrush cung cấp cách vẽ dạng freehand, đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "thư viện Brush nào áp dụng đường viền như một nét vẽ thư pháp?",
        "ans": "Caligraphic"
    },
    {
        "ques": "thư viện brush nào tạo tính ngẫu nhiên trên sản phẩm?",
        "ans": "Scatter"
    },
    {
        "ques": "Điều gì xảy ra khi ánh sáng chiếu vào đối tượng?",
        "ans": "hiện tượng hấp thụ, khi ánh sáng không được phản chiếu lại"
    },
    {
        "ques": "Điểm Mesh có yếu tố nào giống như điểm neo?",
        "ans": "thanh điều hướng"
    },
    {
        "ques": "Điểm Mesh làm việc giống như điểm neo. Đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Đâu là không gian làm việc mặc định của Illustrator CS6?",
        "ans": "Essential"
    },
    {
        "ques": "Đâu là một kiểu graph trong Illustrator?",
        "ans": "Area"
    },
    {
        "ques": "Đâu là một thuộc tính của đối tượng?",
        "ans": "Stroke"
    },
    {
        "ques": "Đâu là một tiện ích của symbol?",
        "ans": "Được tái sử dụng trong các đối tương khác"
    },
    {
        "ques": "Đâu là một trong số những kiểu bề mặt của shading?",
        "ans": "wireframe"
    },
    {
        "ques": "Đâu là một trong số tuỳ chọn với lệnh Envelopes Distort?",
        "ans": "Make with Mesh"
    },
    {
        "ques": "Đâu là thuộc tính của đối tượng Typographic?",
        "ans": "Font"
    },
    {
        "ques": "Đâu là tác dụng đúng của công cụ Mesh?",
        "ans": "có thể thay đổi màu sắc của đối tượng theo nhiều hướng khác nhau"
    },
    {
        "ques": "Để chuyển đổi giữa chế độ xem Outline và chế độ xem Normal, sử dụng tổ hợp phím ",
        "ans": "Ctrl + Y"
    },
    {
        "ques": "Để chuyển đổi giữa chế độ xem Outline và chế độ xem Normal, sử dụng tổ hợp phím tắt nào sau đây?",
        "ans": "Ctrl + Y"
    },
    {
        "ques": "Để hiển thị hộp thoại Live Paint Bucket Option, nhấn đúp vào công cụ này trên th",
        "ans": "Đúng"
    },
    {
        "ques": "Để hiển thị hộp thoại Live Paint Bucket Option, nhấn đúp vào công cụ này trên thanh công cụ. Đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Để hiển thị hộp thoại tuỳ chọn Graph Type, cần sử dụng thao tác nào sau đây?",
        "ans": "lựa chọn nhấn đúp vào công cụ graph"
    },
    {
        "ques": "Để thay đổi đơn vị đo ta có thể",
        "ans": "Kích phải chuột trên thanh thước sau đó chọn đơn vị đo cần đổi"
    },
    {
        "ques": "Để truy cập nhanh vào bảng lệnh Move ta sẽ chọn đối tượng sau đó",
        "ans": "Nhấp đôi vào công cụ Move"
    },
    {
        "ques": "Để tô màu gradient cho chữ, cần phải thực hiện điều gì?",
        "ans": "Chuyển ký tự chữ thành dạng vector bình thường, thông qua menu Type > Create Outlines"
    },
    {
        "ques": "Để xoá bỏ đường canh ( guide ) ta có thể :",
        "ans": "Quét chuột chọn đường canh / ấn Delete"
    },
    {
        "ques": "Để xoá bỏ đường canh ta có thể :",
        "ans": "Quét chuột chọn đường canh / ấn Delete"
    },
    {
        "ques": "Để định dạng : tracking ; kerning ; leading văn bản, sử dụng bảng lệnh nào ?",
        "ans": "Character"
    },
    {
        "ques": "Để ần / hiện Grid ta có thể sử dụng :",
        "ans": "tất cả đều sai"
    },
    {
        "ques": "Đối tượng 3D xoay quanh bao nhiêu trục?",
        "ans": "3"
    },
    {
        "ques": "Đối tượng mesh phức tạp có thể ảnh hưởng tới điều gì sau đây?",
        "ans": "bộ nhớ của máy tính"
    },
    {
        "ques": "Đối tượng mặt nạ nhất thiết phải ở phía trước đối tượng bị che ?",
        "ans": "Đúng"
    },
    {
        "ques": "Đối tượng nào không thể tạo mesh trực tiếp sau đây?",
        "ans": "Text"
    },
    {
        "ques": "Độ phân giải chuẩn cho hình ảnh dạng bimap trên web là bao nhiêu?",
        "ans": "72dpi"
    },
    {
        "ques": "Độ phân giải còn được tính bằng đơn vị nào sau đây?",
        "ans": "ppi"
    }
]