[
    {
        "ques": "Biểu thức sau đây thực hiện phép nhân giữa dữ liệu lưu trong cột ThanhTien của bảng HoaDon: ThanhTien  *  .0775. Nếu cột ThanhTien có kiểu money thì SQL sẽ thực hiện phép chuyển đổi ngầm nào sau đây:",
        "ans": "ThanhTien kiểu money bị chuyển thành kiểu Decimal"
    },
    {
        "ques": "Bảng Deleted:chứa bản sao của các bản ghi được sửa đổi với hoạt động nào?",
        "ans": "DELETE và UPDATE"
    },
    {
        "ques": "Bảng Inserted và Deleted về vật lý có tồn tại trong cơ sở dữ liệu không",
        "ans": "Không"
    },
    {
        "ques": "Case trong SQL có bao nhiêu loại?",
        "ans": "2"
    },
    {
        "ques": "Chế độ sao lưu nào cho phép chỉ giữ lại một bản sao duy nhất của lần sao lưu cuối cùng ?",
        "ans": "Overwrite all existing backup sets"
    },
    {
        "ques": "Chế độ sao lưu nào cho phép lưu nhiều bản sao CSDL từ các lần sao lưu khác nhau vào cùng một file ?",
        "ans": "Append to the existing backup set"
    },
    {
        "ques": "Chế độ “Append to the existing backup set” cho phép điều gì?",
        "ans": "lưu nhiều bản sao CSDL từ các lần sao lưu khác nhau vào cùng một file"
    },
    {
        "ques": "Chế độ “Overwrite all existing backup sets”  cho phép điều gì?",
        "ans": "chỉ giữ lại một bản sao duy nhất của lần sao lưu cuối cùng"
    },
    {
        "ques": "Chọn phát biểu ĐÚNG?",
        "ans": "Cả hai phát biểu đều đúng"
    },
    {
        "ques": "Chọn phát biểu đúng nhất về trigger?",
        "ans": "Trigger là một dạng đặc biệt của thủ tục lưu trữ (store procedure)"
    },
    {
        "ques": "Chọn phát biểu đúng về SQL Server\nA. Là hệ quản trị nội dung cho phép đồng thời một lúc có nhiều người dùng truy xuất đến dữ liệu.\nB. Là hệ quản trị cơ sở dữ liệu quan hệ (RDBMS) do Microsoft phát triển.\nC. Là hệ quản trị CSDL quan hệ cho  phép đồng thời một lúc có nhiều người dùng truy xuất đến dữ liệu.\nD. Là hệ quản trị CSDL quan hệ chỉ cho  phép một người dùng truy xuất đến dữ liệu tại một thời điểm.",
        "ans": "B và C"
    },
    {
        "ques": "Chọn phát biểu đúng về SQL ServerA. Là hệ quản trị nội dung cho phép đồng thời một lúc có nhiều người dùng truy xuất đến dữ liệu.B. Là hệ quản trị cơ sở dữ liệu quan hệ (RDBMS) do Microsoft phát triển.C. Là hệ quản trị CSDL quan hệ cho  phép đồng thời một lúc có nhiều người dùng truy xuất đến dữ liệu.D. Là hệ quản trị CSDL quan hệ chỉ cho  phép một người dùng truy xuất đến dữ liệu tại một thời điểm.",
        "ans": "B và C"
    },
    {
        "ques": "Các bảng Inserted và Deleted. Lưu dữ liệu nào?",
        "ans": "lưu trữ dữ liệu ban đầu cũng như dữ liệu đã sửa đổi"
    },
    {
        "ques": "Các hành động nào kích hoạt trigger thực thi?",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Các khái niệm nào đúng về Stored Procedure ?",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Các kiểu dữ liệu dạng ngày tháng trong Sql?",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Các kiểu dữ liệu dạng số trong Sql?",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Các kiểu dữ liệu nào chỉ có giờ mà không chứa phần ngày?",
        "ans": "time"
    },
    {
        "ques": "Các kiểu dữ liệu nào chỉ có ngày mà không chứa phần giờ",
        "ans": "date"
    },
    {
        "ques": "Các loại Case trong SQL là?",
        "ans": "Searched CASE Simple CASE"
    },
    {
        "ques": "Các lỗi cú pháp nào sau đây thường gặp khi thực thi câu lệnh SQL A. Quên...",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Các trigger DDL chỉ hoạt động trước khi bảng hoặc khung nhìn được sửa đổi là đúng hay sai",
        "ans": "sai"
    },
    {
        "ques": "Các trigger DDL thực thi các thủ tục lưu trữ trên câu lệnh?",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Các trigger DML gồm các loại chính?",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Các trigger DML thực thi trong hoặc sau khi dữ liệu được sửa đổi là đúng hay sai",
        "ans": "đúng"
    },
    {
        "ques": "Các trigger DML thực thi trên các câu lệnh ?",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Các trigger DML được định nghĩa ở mức?",
        "ans": "Cơ sở dữ liệu"
    },
    {
        "ques": "Các ứng dụng nào sau đây có thể truy cập tới hệ quản trị CSDL SQL Server",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Câu lệnh \"SELECT cast(123.2 as decimal(6,2))\" cho kết quả nào?",
        "ans": "123.2"
    },
    {
        "ques": "Câu lệnh \"SELECT cast(123.2 as decimal)\" cho kết quả nào?",
        "ans": "123"
    },
    {
        "ques": "Câu lệnh Break nhận vào bao nhiêu đối số?",
        "ans": "tất cả đáp án đều sai"
    },
    {
        "ques": "Câu lệnh DECLARE @FullName VarChar(25)\n SET @FullName = 'www.poly.edu.vn'\n SELECT SUBSTRING(@FullName, 5, 4)\ntrả ra kết quả?",
        "ans": "poly"
    },
    {
        "ques": "Câu lệnh REPLACE(RIGHT('(559) 555-1212', 13), ') ', '-')\ntrả về kết quả là",
        "ans": "559-555-1212"
    },
    {
        "ques": "Câu lệnh SELECT 100 * .5  cho kết quả bao nhiêu?",
        "ans": "50"
    },
    {
        "ques": "Câu lệnh SELECT CHARINDEX('SQL', 'HELLO SQL Server') trả về kết quả là",
        "ans": "7"
    },
    {
        "ques": "Câu lệnh SELECT DATEDIFF(month, '2008-09-30', '2007-12-01') sau đây trả về kết quả là:",
        "ans": "-9"
    },
    {
        "ques": "Câu lệnh SELECT tạo VIEW cần theo quy định",
        "ans": "Không được chứa mệnh đề INTO, hoặc ORDER BY trừ khi chứa từ khóa TOP"
    },
    {
        "ques": "Câu lệnh SQL có thể viết trên 1 hoặc nhiều dòng?",
        "ans": "Đúng"
    },
    {
        "ques": "Câu lệnh SQL không phân biệt chữ hoa, chữ thường",
        "ans": "Đúng"
    },
    {
        "ques": "Câu lệnh nào dùng tạo cơ sở dữ liệu?",
        "ans": "create database name"
    },
    {
        "ques": "Có 2 loại Store Procedure chính là?",
        "ans": "System stored procedures và User stored procedures"
    },
    {
        "ques": "Có các loại sao lưu dữ liệu nào?",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Có thể khởi động lại SQL Server Agent tại đâu?",
        "ans": "Câu a và b đúng"
    },
    {
        "ques": "Có thể thay thế Create Procedure bằng Create Proc hay không",
        "ans": "Có"
    },
    {
        "ques": "Công cụ nào giúp kết nối và quản lý SQL Server trên giao diện đồ họa thay vì phải dùng tới dòng lệnh?",
        "ans": "SQL Server Management Studio"
    },
    {
        "ques": "Cột NGAYSINH có kiểu dữ liệu SmallDatetime. Hàm CONVERT(varchar, NGAYSINH, a) trả lại kết quả cột NGAYSINH có định dạng dd/mm/yy. Vậy a có giá trị là bao nhiêu?",
        "ans": "3"
    },
    {
        "ques": "Cột NGAYSINH có kiểu dữ liệu SmallDatetime. Hàm CONVERT(varchar, NGÁYINH, a) trả lại kết quả cột NGAYSINH có định dạng dd-mm-yyyy. Vậy a có giá trị là bao nhiêu?",
        "ans": "105"
    },
    {
        "ques": "Differential backup tạo ra tập tin có phần mở rộng là?",
        "ans": "bak"
    },
    {
        "ques": "Edition nào trong Sql server hỗ trợ miễn phí?",
        "ans": "Express"
    },
    {
        "ques": "Edition nào trong Sql server hỗ trợ đầy đủ tính năng nhất?",
        "ans": "Enterpise"
    },
    {
        "ques": "Full backup sao lưu các thành phần nào?",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Full backup tạo ra tập tin có phần mở rộng là gì?",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Full backup tạo ra tập tin có phần mở rộng là gì?",
        "ans": "bak"
    },
    {
        "ques": "GPO có các thành phần nào?",
        "ans": "Computer configuration và User configuration"
    },
    {
        "ques": "Giá trị trả về của hàm do người dùng định nghĩa có thể là?",
        "ans": "Giá trị vô hướng hoặc một bảng"
    },
    {
        "ques": "Giả sử biến @String được khai báo như sau  DECLARE @String varchar(50). Mã kịch bản sau trả về kết quả là",
        "ans": "15"
    },
    {
        "ques": "Giả sử biến @String được khai báo như sau DECLARE @String varchar.Mã kịch bản sau trả về kết quả là  SET @String = 'SQL Server 2008'  SELECT LEN(@String)",
        "ans": "1"
    },
    {
        "ques": "Giả sử thực hiện Full backup tại thời điểm t1, thực hiện differential backup tại thời điểm t2, tiếp tục thực hiện differential backup tại thời điểm t3, hỏi thời điểm t3 sao lưu dữ liệu tính từ t1 hay t2 hay t3?",
        "ans": "t1"
    },
    {
        "ques": "Group Policy Oobject có thể được lưu trữ ở đâu?",
        "ans": "Tại Active Directory"
    },
    {
        "ques": "Gọi thực thi một store-Procedure đã được biên dịch bằng lệnh ?",
        "ans": "Execute"
    },
    {
        "ques": "Hai loại file sử dụng khi Attach một CSDL là:",
        "ans": "mdf và ldf"
    },
    {
        "ques": "Hai loại xác thực khi kết nối SQL Server là?",
        "ans": "Windows Authentication và SQL Server Authentication"
    },
    {
        "ques": "Hàm CAST nào sau đây ĐÚNG cú pháp",
        "ans": "CAST(InvoiceDate AS varchar)"
    },
    {
        "ques": "Hàm fnTonghaiso nhận hai tham số đầu vào @a và @b  kiểu int và trả về kết quả tổng hai số.\nĐoạn mã kịch bản nào sau đây trả về kết quả  tổng của hai số 1 và 5",
        "ans": "select dbo.fnTonghaiso(1,5)"
    },
    {
        "ques": "Hàm người dùng định nghĩa nếu muốn sử dụng giá trị mặc định, phải đặt từ khóa nào tại đúng vị trí tham số tùy chọn đó?",
        "ans": "DEFAULT"
    },
    {
        "ques": "Hàm nào sau đây không phải chuẩn ANSI và chỉ được hỗ trợ bởi SQL Server",
        "ans": "CONVERT"
    },
    {
        "ques": "Khi khai báo tham số cho Store Procedure, có những loại tham số nào?",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Khi kết nối tới CSDL SQL Server, chế độ xác thực nào sau đây người dùng phải...",
        "ans": "SQL Server Authentication"
    },
    {
        "ques": "Khi tạo database thì các thông số nào có liên quan?",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Khái niệm đúng về System stored procedures?",
        "ans": "Là những stored procedure chứa trong Master Database, thường bắt đầu bằng tiếp đầu ngữ sp_"
    },
    {
        "ques": "Kiểu chuỗi CHAR(kich_thuoc) có chứa ký tự Unicode hay không?",
        "ans": "Không"
    },
    {
        "ques": "Kiểu chuỗi nào dùng được ký tự Unicode?",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Kiểu dữ liệu nào chỉ lưu 2 giá trị là 1 và 0?",
        "ans": "BIT"
    },
    {
        "ques": "Kiểu dữ liệu nào trong SQL lưu được giá trị là chuỗi?",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Kiểu dữ liệu trong SQL được áp dụng cho các đối tượng nào?",
        "ans": "Biến và Cột (column)"
    },
    {
        "ques": "Loại thủ tục nào do người sử dụng tạo và thực hiện",
        "ans": "User stored procedures"
    },
    {
        "ques": "Lược đồ CSDL hiển thị những thông tin nào?",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Lệnh gán giá trị cho cột NGAYSINH có kiểu SmallDatetime sau đây có thực hiện phép chuyển đổi ngầm không\nNGAYSINH = '2008-08-05'",
        "ans": "Thực hiện phép chuyển đổi ngầm, giá trị chuỗi 2008-08-05 sẽ bị chuyển thành kiểu SmallDatetime"
    },
    {
        "ques": "Lệnh nào khai báo một biến có giá trị 100?",
        "ans": "Declare @v_b Int = 100;"
    },
    {
        "ques": "Lệnh nào khai báo một biến table?",
        "ans": "DECLARE  @NhanVien_HCM Table ( MaNV nvarchar(9),TenNV nvarchar(15))"
    },
    {
        "ques": "Lợi ích khi sử dụng View?",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Lựa chọn nào sau đây vi phạm điều kiện để tạo một VIEW có thể cập nhật",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Mã kịch bản nào sau đây khai báo thành công một hàm tính tổng hai số",
        "ans": "CREATE FUNCTION fnTonghaiso(  @a int = 0,    @b int = 0)\n RETURNS int\nBEGIN\n    RETURN (@a+@b)\nEND"
    },
    {
        "ques": "Mục đích của việc sao lưu dữ liệu là gì?",
        "ans": "phục hồi khi có sự cố"
    },
    {
        "ques": "Mục đích sử dụng SQL Server?",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Nhập và thực thi câu lệnh SQL bằng cách",
        "ans": "Nhập câu lệnh vào cửa sổ Query Editor và bấm F5"
    },
    {
        "ques": "Nếu cột NGAYSINH có kiểu dữ liệu SmallDatetime. Hàm CONVERT(varchar, NGAYSINH, 1) trả lại kết quả cột NGAYSINH có định dạng nào sau đây",
        "ans": "mm/dd/yy"
    },
    {
        "ques": "Nếu thực thi hai hoặc nhiều câu lệnh trong mệnh đề IF hoặc ELSE. Bạn cần bao...",
        "ans": "BEGIN…END"
    },
    {
        "ques": "Nếu trong đoạn code có WHILE LOOP lồng nhau, BREAK sẽ làm gì?",
        "ans": "chấm dứt vòng lặp WHILE gần nhất"
    },
    {
        "ques": "Phát biểu 'Chấp nhận những tham số vào và trả về những giá trị được chứa trong các tham số ra để gọi những thủ tục hoặc xử lý theo lô' là đúng hay sai?",
        "ans": "Đúng"
    },
    {
        "ques": "Phát biểu 'Một khối lệnh bắt đầu bởi BEGIN và kết thúc bởi END' trong T-Sql đúng hay sai",
        "ans": "đúng"
    },
    {
        "ques": "Phát biểu nào chính xác nhất về Trigger DML ?",
        "ans": "Các trigger DML thực thi trong hoặc sau khi dữ liệu được sửa đổi."
    },
    {
        "ques": "Phát biểu nào chính xác nhất về Trigger INSTEAD OF ?",
        "ans": "Trigger INSTEAD OF được thực thi thay thế cho các hoạt động INSERT, UPDATE hoặc DELETE"
    },
    {
        "ques": "Phát biểu nào chính xác về Trigger insert?",
        "ans": "Trigger INSERT được thực thi khi một bản ghi mới được chèn vào bảng"
    },
    {
        "ques": "Phát biểu nào sau đây đúng về hàm người dùng  định nghĩa",
        "ans": "Các hàm luôn phải trả về một giá trị, sử dụng câu lệnh RETURN"
    },
    {
        "ques": "Phát biểu nào sau đây đúng về hàm người dùng  định nghĩa",
        "ans": "Hàm không có tham số đầu ra"
    },
    {
        "ques": "Phát biểu nào sau đây đúng về hàm người dùng  định nghĩa",
        "ans": "Là một đối tượng CSDL chứa các câu lệnh SQL, được biên dịch sẵn và lưu trữ trong CSDL và luôn phải trả về một giá trị."
    },
    {
        "ques": "Phát biểu nào sau đây đúng về hàm người dùng  định nghĩa",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Phát biểu nào đúng về Differential backup?",
        "ans": "Sao lưu các dữ liệu mới được cập  nhật kể từ lần full backup trước đó"
    },
    {
        "ques": "Phát biểu nào đúng về Searched CASE  ?",
        "ans": "Searched CASE  là đánh giá một bộ các biểu thức Boolean để xác định kết quả"
    },
    {
        "ques": "Phát biểu nào đúng về Simple CASE ?",
        "ans": "Simple CASE là so sánh một biểu thức với một bộ các biểu thức đơn giản để xác định kết quả"
    },
    {
        "ques": "Phát biểu nào đúng về System stored procedures?",
        "ans": "Chủ yếu dùng trong việc quản lý cơ sở dữ liệu (administration) và bảo mật (security)"
    },
    {
        "ques": "Phát biểu nào đúng về Transaction log backup?",
        "ans": "Sao lưu các bản ghi transaction log (các thao tác xảy ra trên CSDL, không sao lưu dữ liệu)"
    },
    {
        "ques": "Phát biểu nào đúng về Try…Catch",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Phát biểu nào đúng về full backup?",
        "ans": "Sao lưu toàn bộ cơ sở dữ liệu được chỉ định"
    },
    {
        "ques": "Phát biểu nào đúng về độ ưu tiên khi chuyển kiểu dữ liệu trong SQL",
        "ans": "SQL chuyển kiểu có độ ưu tiên thấp sang kiểu có độ ưu tiên cao hơn"
    },
    {
        "ques": "Phát biểu sau đây đúng hay sai?\n\"Khi sử dụng View để cập nhật dữ liệu trong các bảng cơ sở, SQL Server sẽ tự động kiểm tra các ràng buộc toàn vẹn trên các bảng\"",
        "ans": "Đúng"
    },
    {
        "ques": "Phát biểu sau đây đúng hay sai?\n\"Tên view được trùng với tên bảng hoặc view đã tồn tại\"",
        "ans": "Sai"
    },
    {
        "ques": "Phát biểu sau đây đúng hay sai?\"Bằng cách chỉ định các cột trong View, các dữ liệu quan trọng chứa  trong một số cột của bảng có thể được che dấu\"",
        "ans": "Đúng"
    },
    {
        "ques": "Phát biểu sau đây đúng hay sai?\"Khi sử dụng View để cập nhật dữ liệu trong các bảng cơ sở, SQL Server sẽ tự động kiểm tra các ràng buộc toàn vẹn trên các bảng\"",
        "ans": "Đúng"
    },
    {
        "ques": "Phát biểu sau đây đúng về hàm người dùng  định nghĩa là đúng hay sai?\n\"Có thể tạo bảng, bảng tạm, biến bảng và thực hiện các câu lệnh INSERT, UPDATE, DELETE trên các bảng, bảng tạm, biến bảng vừa tạo trong thân hàm\"",
        "ans": "Đúng"
    },
    {
        "ques": "Phát biểu sau đây đúng về hàm người dùng  định nghĩa là đúng hay sai?\n\"Không được chứa các câu lệnh INSERT, UPDATE, DELETE một bảng hoặc view đang tồn tại trong CSDL\"",
        "ans": "Đúng"
    },
    {
        "ques": "Phát biểu sau đây đúng về hàm người dùng  định nghĩa là đúng hay sai?\n\"hàm tự động thực thi khi có thao tác insert, update, delete\"",
        "ans": "sai"
    },
    {
        "ques": "Phát biểu sau đây đúng về hàm người dùng  định nghĩa là đúng hay sai?\"Có thể tạo bảng, bảng tạm, biến bảng và thực hiện các câu lệnh INSERT, UPDATE, DELETE trên các bảng, bảng tạm, biến bảng vừa tạo trong thân hàm\"",
        "ans": "Đúng"
    },
    {
        "ques": "Phát biểu sau đây đúng về hàm người dùng  định nghĩa là đúng hay sai?\"Không được chứa các câu lệnh INSERT, UPDATE, DELETE một bảng hoặc view đang tồn tại trong CSDL\"",
        "ans": "Đúng"
    },
    {
        "ques": "Phát biểu sau đúng hay sai: Hoạt động INSERT và UPDATE sẽ tiến hành&nbsp;chèn các bản ghi mới vào bảng Inserted và bảng&nbsp;trigger",
        "ans": "đúng"
    },
    {
        "ques": "Phạm vi ảnh hưởng của GPO?",
        "ans": "Site -> Domain -> OUs"
    },
    {
        "ques": "Qui đinh đặt tên cột trong View",
        "ans": "Cột chứa giá trị được tính toán từ nhiều cột khác phải được đặt tên"
    },
    {
        "ques": "SELECT 'Today is ' + GETDATE()=>Kết quả kiểu dữ liệu là gì?",
        "ans": "Câu lệnh lỗi ép kiểu"
    },
    {
        "ques": "SQL Server chỉ thực hiện sao lưu tự động thành công khi ?",
        "ans": "SQL Server Agent đang chạy"
    },
    {
        "ques": "SQL server có cho phép đặt lịch tự động xóa các bản sao lưu cũ theo thời gian nhất định hay không?",
        "ans": "Có"
    },
    {
        "ques": "SQL sử dụng ngôn ngữ nào sau đây để truy vấn CSDL?",
        "ans": "Transact-SQL"
    },
    {
        "ques": "Stored-procedure trong SQL Server bao gồm các thành phần chính nào?",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Sử dụng lệnh nào chọn database cần thao tác",
        "ans": "Use"
    },
    {
        "ques": "Sử dụng đến câu lệnh if-else/case là là câu lệnh điều kiện được sử dụng khi ?",
        "ans": "khi có nhiều lựa chọn, cần đưa ra một quyết định nào đó"
    },
    {
        "ques": "Tham số đầu vào Store Procedure có được gán giá trị mặc định hay không?",
        "ans": "Có"
    },
    {
        "ques": "Thao tác nào cần thực hiện khi duy chuyển tập tin mdf và ldf tới vị trí mới?",
        "ans": "detach"
    },
    {
        "ques": "Thành phần nào dưới đây là thành phần của Group Policy management editor?",
        "ans": "User Configuration"
    },
    {
        "ques": "Thành phần nào sau đây của GPOs cho phép bạn cấu hình các thiết lập ảnh hưởng đế",
        "ans": "Administrative Templates"
    },
    {
        "ques": "Thông thường dữ liệu các thao tác insert, update, delete được sao lưu vào bảng tạm?",
        "ans": "inserted và deleted"
    },
    {
        "ques": "Transaction log backup tạo ra tập tin có phần mở rộng là ?",
        "ans": "trn"
    },
    {
        "ques": "Trigger AFTER có thể được tạo ra trên các đối tượng nào?",
        "ans": "table"
    },
    {
        "ques": "Trigger là một stored procedure ?",
        "ans": "Không chứa tham số"
    },
    {
        "ques": "Trigger thường được dùng làm gì?",
        "ans": "Ràng buộc dữ liệu"
    },
    {
        "ques": "Trigger được thực thi bằng lệnh nào?",
        "ans": "Tự động"
    },
    {
        "ques": "Trong SQL hỗ trợ bao nhiêu cách để chuyển đổi các kiểu dữ liệu?",
        "ans": "2"
    },
    {
        "ques": "Trong Windows Server 2008, bạn sử dụng công cụ nào để tạo và thực hiện các hoạt ",
        "ans": "Group Policy Management Console"
    },
    {
        "ques": "Tên hàm, tên biến trong SQL Server có phân biệt hoa thường hay không?",
        "ans": "Không"
    },
    {
        "ques": "VIEW có thể cập nhật (updatable view) cho phép",
        "ans": "Xem dữ liệu và cập nhật dữ liệu trong các bảng cơ sở qua View"
    },
    {
        "ques": "Việc chuyển đổi kiểu dữ liệu ngầm định do?",
        "ans": "SQL server tự thực hiện"
    },
    {
        "ques": "Việc chuyển đổi kiểu dữ liệu tường minh do?",
        "ans": "sử dụng các hàm thư viện"
    },
    {
        "ques": "Việc thực hiện Full Backup nhiều sẽ gặp khó khăn nào?",
        "ans": "Tất cả đáp án đều đúng"
    },
    {
        "ques": "Xác thực nào sử dụng sử dụng Windows Login ID",
        "ans": "Windows Authentication"
    },
    {
        "ques": "Xác thực nào sử dụng sử dụng sử dụng SQL Login ID",
        "ans": "SQL Server Authentication"
    },
    {
        "ques": "tập tin nào lưu trữ các đối tượng trong database như table, view?",
        "ans": "mdf"
    },
    {
        "ques": "tập tin nào lưu trữ quá trình cập nhật/thay đổi dữ liệu?",
        "ans": "ldf"
    },
    {
        "ques": "từ khóa Break có công dụng nào?",
        "ans": "Dùng để khởi tạo vòng lặp"
    },
    {
        "ques": "Đoạn chương trình sau xuất ra bao nhiêu ký tự 'A'\nDeclare @dem int=0;\nWHILE @dem<2\nBEGIN\n IF @dem=3\n begin\n Continue\n end\n ELSE\n PRINT 'A'\n SET @dem=@dem+1\nEND\nPRINT 'B'",
        "ans": "2"
    },
    {
        "ques": "Đoạn chương trình sau xuất ra bao nhiêu ký tự 'A'\nDeclare @dem int=0;\nWHILE @dem<3\nBEGIN\nPRINT 'A'\nSET @dem=@dem+2\nEND\nPRINT 'B'\nGO",
        "ans": "2"
    },
    {
        "ques": "Đoạn chương trình sau xuất ra bao nhiêu ký tự 'A'\nDeclare @dem int=0;\nWHILE @dem<8\nBEGIN\n IF @dem=3\n BREAK\n ELSE\n PRINT 'A'\n SET @dem=@dem+1\nEND\nPRINT 'B'\nGO",
        "ans": "3"
    },
    {
        "ques": "Đoạn chương trình sau xuất ra bao nhiêu ký tự 'A'\nDeclare @dem int=0;\nWHILE @dem<8\nBEGIN\n IF @dem=3\n begin\n Continue\n end\n ELSE\n PRINT 'A'\n SET @dem=@dem+1\nEND\nPRINT 'B'",
        "ans": "Tất cả đáp án đều sai"
    },
    {
        "ques": "Đoạn chương trình sau xuất ra bao nhiêu ký tự 'B'\nDeclare @dem int=0;\nWHILE @dem<3\nBEGIN\nPRINT 'A'\nSET @dem=@dem+1\nEND\nPRINT 'B'\nGO",
        "ans": "1"
    },
    {
        "ques": "Đoạn lệnh sau cho kết quả nào?  : \ndeclare @tb float\nset @tb=5;\nselect iif(@tb>7,'Kha','Tb')",
        "ans": "TB"
    },
    {
        "ques": "Đoạn lệnh sau cho kết quả nào?  :  IF 1=1  BEGIN  PRINT '1=1 la...",
        "ans": "1=1 la dung"
    },
    {
        "ques": "Đoạn lệnh sau cho kết quả nào? CREATE PROC spud_TinhTong_Bien @s1 int,@s2...",
        "ans": "Lỗi ép kiểu"
    },
    {
        "ques": "Đoạn lệnh sau cho kết quả nào?CREATE PROC spud_TinhTong_Bien @s1 int,@s2 intASDECLARE @tg int Begin set @tg=@s1+@s2 print N'Tong là:' + CAST(@tg AS varchar (8))EndEXEC spud_TinhTong_Bien 1,3",
        "ans": "Tổng là 4"
    },
    {
        "ques": "Đoạn lệnh sau cho ra kết quả nào?\nCREATE PROCEDURE sp_Tong @So1 int =1, @So2 int=2\nAS \nBegin \nDeclare @Tong int  \nSET @Tong = @So1 + @So2; \nPrint @Tong\nEnd \nExec sp_Tong 1, 1",
        "ans": "2"
    },
    {
        "ques": "Đoạn lệnh sau thực hiện điều gi?\nALTER PROCEDURE  procedure_name    [ {@parameter data_type } ]       AS \n Begin   [khai báo các biến cho xử lý]   \n{Các câu lệnh transact-sql}  \nEnd",
        "ans": "Cập nhật Store procedure"
    },
    {
        "ques": "Đoạn lệnh sau thực hiện điều gi?\nCREATE PROCEDURE  procedure_name  {@parameter data_type  input/output }\nAS  \nBegin   [khai báo các biến cho xử lý]   \n{Các câu lệnh transact-sql} \n End",
        "ans": "Tạo mới Store procedure"
    },
    {
        "ques": "Đoạn lệnh sau thực hiện điều gi? DROP PROCEDURE  procedure_name",
        "ans": "Xóa Store procedure"
    },
    {
        "ques": "Đoạn lệnh sau thực hiện điều gi?ALTER PROCEDURE  procedure_name    [ {@parameter data_type } ]       AS  Begin   [khai báo các biến cho xử lý]   {Các câu lệnh transact-sql}  End",
        "ans": "Cập nhật Store procedure"
    },
    {
        "ques": "Đoạn lệnh sau thực hiện điều gi?CREATE PROCEDURE  procedure_name  {@parameter data_type  input/output }AS  Begin   [khai báo các biến cho xử lý]   {Các câu lệnh transact-sql}  End",
        "ans": "Tạo mới Store procedure"
    },
    {
        "ques": "Đoạn mã kịch bản nào sau đây thực hiện khai báo một biến và gán giá trị cho biến đó bằng 1",
        "ans": "Chỉ A, B, C đúng"
    },
    {
        "ques": "Đâu là thứ tự ưu tiên của các kiểu dữ liệu phổ biến trong SQL Server",
        "ans": "Ngày giờ - số - chuỗi"
    },
    {
        "ques": "Đặt lịch sao lưu tự động là?",
        "ans": "Tạo một kế hoạch cho SQL Server để SQL Server tự động thực hiện sao lưu CSDL tại một thời điểm được ấn định sẵn"
    },
    {
        "ques": "Để thiết lập GPO người dùng liên quan Control Panel. Trong Group Policy Management Editor bạn chọn?",
        "ans": "User Configuration -> Policies ->  Administrative tool -> Control Panel"
    },
    {
        "ques": "Để thiết lập GPO người dùng liên quan Desktop. Trong Group Policy Management Editor bạn chọn?",
        "ans": "User Configuration -> Policies ->  Administrative tool -> Desktop"
    },
    {
        "ques": "Để thiết lập chính sách mật khẩu cho các tài khoản. Bạn chọn thành phần nào của GPO?",
        "ans": "User configuration"
    },
    {
        "ques": "Để thực hiện trả kết quả ra từ store procedure thì dùng những từ khóa nào?",
        "ans": "Output và Return"
    },
    {
        "ques": "Để triển khai phần mềm thông qua chính sách GPO, người ta thường sử dụng dạng file gì?",
        "ans": ".MSI hoặc .ZAP"
    },
    {
        "ques": "Để tạo lịch sao lưu tự động người dùng phải đăng nhập bằng Login ID có vai trò ?",
        "ans": "SysAdmin"
    },
    {
        "ques": "Để điều hướng qua các đối tượng của CSDL trên SQL Management Studio, sử dụng",
        "ans": "Cửa sổ Object Explorer"
    }
]